import 'package:flutter/cupertino.dart';

class RecipesList {
  final String title;
  final List description;
  final String image;
  final double star;
  final double duration;
  final List uses;

  RecipesList(
      {required this.title,
      required this.description,
      required this.image,
      required this.star,
      required this.duration,
      required this.uses});
}

class RecipesLists with ChangeNotifier {
  final List<RecipesList> _recipe = [
    RecipesList(
      title: 'كيكة الشاي',
      description: [
        '4 بيضة',
        'برش برتقال',
        'كوب ونصف سكر',
        'ملعقة صغيرة فانيلا',
        'كوب ونصف حليب',
        'ثلاث ارباع الكوب زيت',
        '3 كوب ونصف دقيق',
        '2 ملعقة صغيرة بيكنج بودر',
        'ملعقة كبيرة خل',
        '2 ملعقة كبيرة زبادي',
      ],
      uses: [
        'في الخلاط نضع بالتدريج البيض والفانيلا وبرش البرتقال والخل ثم السكر ونخلط جيدا',
        'ثم يضاف الزيت والزبادي ثم الحليب نخلطهم لمدة 2 دقيقة حتى تختلط كل المكونات',
        'نضعهم في وعاء عميق ثم ننخل فوقهم الدقيق والباكينج باودر ونقلبهم بالملعقة',
        'نضعهم في صينية مبطنة بورق زبدة وندخلهم الفرن الساخن مسبقا على درجة 180 مدة 45 دقيقة'
      ],
      image: 'lib/assets/RecImage/1.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'دونتس',
      description: [
        '٢كوب دقيق',
        'معلقة صغيرة مليانة خميرة فورية',
        'معلقتين زبدة طرية',
        'معلقة كبيرة سكر',
        'بيضة درجة حرارة الغرفة',
        'ربع كوب ماء دافي',
        'ربع كوب حليب دافي',
        'رشة ملح',
        'فانيليا',
      ],
      uses: [
        "نضع اللبن الدافئ والمياه الدافية مع الخميرة والسكر ونقلبهم",
        "وبعد كدة نضع البيضة ونقلبهم بمعلقة خشب وننزل باول كوب من الدقيق لحد ما تبقي العجينة لينة ونسيبها تخمر نصف ساعة",
        " وبعد كدة نجيب الخليط ونحط الزبدة ونعجن بسيط ونحط كوب الدقيق التاني ورشة الملح ونعجن كويس اوي مش اقل من ٧ دقايق ",
        "وبعد كدة نسيبها تخمر من نصف ساعة لساعة ويفضل ساعة",
        " وبعد ما تخمر نفرد العجين ونخليه سمكوا مش رفيع اوي ونقطعه بقطاعة الدونتس",
        " ونحطوا علي صينيه يخمر تاني نصف ساعة وممكن تعملي جزء مدور عادي بالقطاعة المدورة مش قطاعة الدونتس",
        " وبعد كدة نحمروا علي نار مش سخنة اوي ومش باردة علشان يستوي لحد ما ياخد لون حلو",
      ],
      image: 'lib/assets/RecImage/2.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'سويسرول بالشوكولاتة ',
      description: [
        ' دقيق : كوب ',
        ' حليب : نصف كوب',
        ' سكر البودرة : نصف كوب',
        ' الكاكاو : 2 ملعقة كبيرة (خام)',
        ' بيكنج بودر : ملعقة صغيرة',
        ' الفانيليا : 2 ملعقة صغيرة',
        ' البيض : 4 حبات',
        ' الشوكولاتة : نصف كوب مذابة',
        ' كريمة الخفق للتزيين او كريم شانتية',
      ],
      uses: [
        ' قومي بخلط جميع المكونات مع بعضها جيداً بالمضرب الكهربائي',
        'أحضري صينية مستطيلة وافرشيها ورق زبدة وصبي فوقها الخليط ثم ادخليها الفرن الساخن على درجة حرارة 180 لمدة 10 دقيقة ثم اخرجيها لتبرد',
        'ضعيها على سطح العمل ثم احشيها بالكريمة ولفيها زي الساندويتش ثم انزلى عليها بالشوكليت المذاب ثم ادخليها الثلاجة لمدة ساعة ثم تقطع وتقدم',
        'أضيفي عليها الشوكولاتة وافرديها ثم لفيها روول وأدخليها الثلاجة لمدة ساعة',
        'أخرجي الكيك من الثلاجة وقطعيها وضعي فوقها صوص الشوكولاتة',
      ],
      image: 'lib/assets/RecImage/3.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كيكة البرتقال',
      description: [
        '5 بيض بحرارة الغرفة',
        'كوب ونص سكر',
        'بشر برتقالة',
        'بشر ليمونة',
        'ملعقة صغيرة فانيلا',
        'كوب زيت',
        'نص كوب حليب دافىء',
        '3 كوب طحين منخول مرتين',
        '2 ملعقة صغيرة خميرة الحلويات (بيكنج باودر)',
        'رشة صغيرة ملح',
        'نص ملعقة صغيرة بيكربونات الصوديوم',
        'ملعقة صغيرة خل',
      ],
      uses: [
        '1- على سرعة عالية نخفق البيض مع السكر 8 دقائق حتى يصبح الخليط فاتح وكريمي.',
        '2- نضيف برش الليمون والبرتقال والفانيلا.',
        '3- نخفف السرعة وبنضيف الزيت بالتدريج ونخفق .',
        '4- نضيف العصير والحليب ونخفق كمان شوي.',
        '5- نضيف الطحين المنخول مرتين مع البيكنغ باودر ورشة صغيرة ملح ونخفق ع سرعة بطيئة .',
        '5- بفور بيكربونات الصوديوم بالخل وبسكبها عالخليط وبقلب تقليبه خفيفة وبسكب الخليط بقالب مدهون زبدة ومرشوش طحين .',
        '6- ندخل القالب في فرن محمى مسبقا عال 160 درجة بياخد 45 دقيقة تقريبا او حسب نوع الفرن ، ثم يقدم بالعافية .',
      ],
      image: 'lib/assets/RecImage/4.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/5.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'فطائر الجبنة😋',
      description: [
        "3 كوب دقيق",
        "3 ملاعق لبن بودرة",
        "ملعقة كبيرة خميرة فورية",
        "ملعقة كبيرة سكر",
        "نص كوب لبن دافئ",
        "ملعقة كبيرة ونص زبدة",
        "ماء دافي حسب الاحتياج ( حوالي نص كوب)",
        "رشة ملح"
      ],
      uses: [
        "في وعاء العجن نضيف السكر والخميرة و نص كوب دقيق واللبن ونقلب جيدا وتترك لمدة 10 دقائق لتخمر .",
        "ثم نضيف اليه باقي كمية الدقيق واللبن البودرة ورشة الملح ونقوم بالعجن واضافة ماء دافئ بالتدريج حسب الحاجة ،ثم نضيف الزبدة ونستمر فى العجن حتي الحصول على قوام ناعم ومطاطي للعجينة.",
        "نترك العجينة ترتاح لمدة 10 دقائق.",
        "نفرد العجينة بالمدلكة على سطح مرشوش بالدقيق إلى سمك رقيق جداً.",
        "نفردها باليد بالتساوي ونضع الجبنة في النصف ونطوى العجينة على الجبنة.",
        "نقوم بقطع العجين إلى مثلثات صغيرة.",
        "نضعها في صينية الفرن وندهنها بالبيض المخفوق.",
        "نخبزها في فرن متوسط الحرارة حتى يصبح لونها ذهبياً."
      ],
      image: 'lib/assets/RecImage/6.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/7.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/8.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/9.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/10.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/11.jpeg',
      duration: 50,
      star: 4,
    ),
    RecipesList(
      title: 'كنافة بالنوتيلا',
      description: [
        '  ½ ك كنافة',
        'شوكولاتة نوتيلا',
        '100 جرام زبدة، لينة',
        'شراب القطر',
        'زبدة للدهن',
      ],
      uses: [
        'فكّى الكنافة من بعضها.',
        'سخنى الزبدة على النار وفور ذوابانها صبيها على الكنافة بالتساوى وقلبيها جيدا باستخدام يديكِ حتى تتشرب الكنافة من الزبدة جيدا.',
        'سخنى الفرن على 250 درجة مئوية.',
        'قسمى الكنافة على قسمين.',
        'ادهنى صينية الخبز بقليل وضعى نصف كمية الكنافة فيها واضغطى عليها لتشكل قرص مستوى.',
        'كررى العملية فى صينية اخرى نفس النوع والمقاس مع النصف الاخر من الكنافة.',
        'ادخلى قرصى الكنافة فى الفرن واتركيهم حتى يصبح لونهم ذهبى مقرمش.',
        'اخرجى الكنافة من الفرن وصبى على القرصين الساخنين شراب القطر.',
        'اتركى الكنافة حتى تبرد وتتشرب القطر كليا.'
      ],
      image: 'lib/assets/RecImage/12.jpeg',
      duration: 50,
      star: 4,
    ),
  ];
  List<RecipesList> get recipe {
    return [..._recipe];
  }
}
